class Chat:

    NO_AUTH_USER = """🚫 <b>ᴀᴄᴄᴇss ᴅᴇɴɪᴇᴅ!</b>  
<b>ʏᴏᴜ ᴀʀᴇ ɴᴏᴛ ᴀᴜᴛʜᴏʀɪᴢᴇᴅ ᴛᴏ ᴜsᴇ ᴛʜɪs ʙᴏᴛ.</b>  

💡 <b>ᴄʀᴇᴅɪᴛs:</b> <b>@Yae_X_Miko</b> 
    """

    DOWNLOAD_SUCCESS = """✅ <b>ғɪʟᴇ ᴅᴏᴡɴʟᴏᴀᴅᴇᴅ sᴜᴄᴄᴇssғᴜʟʟʏ!</b>  

⏳ <b>ᴛɪᴍᴇ ᴛᴀᴋᴇɴ:</b> <b>{} sᴇᴄᴏɴᴅs</b><b>.</b>  

💡 <b>ᴄʀᴇᴅɪᴛs:</b> <b>@Yae_X_Miko</b>
    """

    FILE_SIZE_ERROR = "❌ <b>ᴇʀʀᴏʀ:</b> <b>ᴜɴᴀʙʟᴇ ᴛᴏ ᴇxᴛʀᴀᴄᴛ ғɪʟᴇ sɪᴢᴇ ғʀᴏᴍ ᴛʜᴇ ᴜʀʟ!</b>\n\n💡 <b>ᴄʀᴇᴅɪᴛs:</b> <b>@Yae_X_Miko</b>"
    MAX_FILE_SIZE = "⚠️ <b>ғɪʟᴇ ᴛᴏᴏ ʟᴀʀɢᴇ! ᴛʜᴇ ᴍᴀxɪᴍᴜᴍ ғɪʟᴇ sɪᴢᴇ ᴀʟʟᴏᴡᴇᴅ ʙʏ ᴛᴇʟᴇɢʀᴀᴍ ɪs 2ɢʙ.</b>\n\n💡 <b>ᴄʀᴇᴅɪᴛs:</b> <b>@Yae_X_Miko</b>"
    
    LONG_CUS_FILENAME = """⚠️ <b>ғɪʟᴇɴᴀᴍᴇ ᴛᴏᴏ ʟᴏɴɢ!</b>  
<b>ᴛʜᴇ ғɪʟᴇɴᴀᴍᴇ ʏᴏᴜ ᴘʀᴏᴠɪᴅᴇᴅ ᴇxᴄᴇᴇᴅs 60 ᴄʜᴀʀᴀᴄᴛᴇʀs.</b>  
<b>ᴘʟᴇᴀsᴇ ᴜsᴇ ᴀ sʜᴏʀᴛᴇʀ ɴᴀᴍᴇ.</b>  

💡 <b>ᴄʀᴇᴅɪᴛs:</b> <b>@Yae_X_Miko</b>
    """

    UNSUPPORTED_FORMAT = "❌ <b>ᴇʀʀᴏʀ:</b> <b>ғɪʟᴇ ғᴏʀᴍᴀᴛ {} ɪs ɴᴏᴛ sᴜᴘᴘᴏʀᴛᴇᴅ!</b>\n\n💡 <b>ᴄʀᴇᴅɪᴛs:</b> <b>@Yae_X_Miko</b>"
